#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
tls_private_key.this: Refreshing state... [id=1708e902105accf9e2a7f27b9b70f1276f082182]
tls_self_signed_cert.this: Refreshing state... [id=34741732969509528735783077749849221349]
aws_elastic_beanstalk_application.app: Refreshing state... [id=staging-hello-world]
aws_sns_topic.alert_sns_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:122315759805:staging-hello-world]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:122315759805:certificate/0b6982bc-da98-43a3-92b5-65f053aa2e9d]
aws_s3_bucket.dist_bucket: Refreshing state... [id=staging-elb-dist]
aws_iam_role.service: Refreshing state... [id=staging-eb-service]
aws_iam_role.ec2: Refreshing state... [id=staging-eb-ec2]
aws_iam_role_policy_attachment.service: Refreshing state... [id=staging-eb-service-20210404032023774900000002]
aws_cloudformation_stack.tf_sns_topic_subscription: Refreshing state... [id=arn:aws:cloudformation:ca-central-1:122315759805:stack/staging-snsStack/b1a9abf0-94f4-11eb-afb4-02d7133f8f9a]
aws_iam_role_policy_attachment.elastic_beanstalk_multi_container_docker: Refreshing state... [id=staging-eb-ec2-20210404032023793900000003]
aws_iam_instance_profile.ec2: Refreshing state... [id=staging-eb-ec2]
aws_iam_role_policy.default: Refreshing state... [id=staging-eb-ec2:staging-eb-default]
aws_elastic_beanstalk_environment.this: Refreshing state... [id=e-xawehiprch]
aws_s3_bucket_object.dist_item: Refreshing state... [id=staging/dist-c898b77b-e0fe-0f9d-132c-e11b878dd48b]
aws_elastic_beanstalk_application_version.this: Refreshing state... [id=staging-hello-world-ea0f3865-dbdc-609b-56a2-6dad574ffbd6]
aws_cloudwatch_metric_alarm.cpu[0]: Refreshing state... [id=staging-hello-world-cpu]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application_version.this must be replaced
-/+ resource "aws_elastic_beanstalk_application_version" "this" {
      ~ arn          = "arn:aws:elasticbeanstalk:ca-central-1:122315759805:applicationversion/staging-hello-world/staging-hello-world-ea0f3865-dbdc-609b-56a2-6dad574ffbd6" -> (known after apply)
      ~ id           = "staging-hello-world-ea0f3865-dbdc-609b-56a2-6dad574ffbd6" -> (known after apply)
      ~ key          = "staging/dist-c898b77b-e0fe-0f9d-132c-e11b878dd48b" -> (known after apply) # forces replacement
      ~ name         = "staging-hello-world-ea0f3865-dbdc-609b-56a2-6dad574ffbd6" -> (known after apply) # forces replacement
      - tags         = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_environment.this will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "this" {
        id                     = "e-xawehiprch"
        name                   = "staging-hello-world"
        tags                   = {}
        # (17 unchanged attributes hidden)

      - setting {
          - name      = "BreachDuration" -> null
          - namespace = "aws:autoscaling:trigger" -> null
          - value     = "5" -> null
        }
      + setting {
          + name      = "BreachDuration"
          + namespace = "aws:autoscaling:trigger"
          + value     = "5"
        }
      - setting {
          - name      = "InstancePort" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "80" -> null
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:443"
          + value     = "80"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener"
          + value     = "false"
        }
      - setting {
          - name      = "ListenerEnabled" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "true" -> null
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:443"
          + value     = "true"
        }
      - setting {
          - name      = "ListenerProtocol" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "HTTPS" -> null
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:443"
          + value     = "HTTPS"
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "4" -> null
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      - setting {
          - name      = "MinSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "1" -> null
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      - setting {
          - name      = "SSLCertificateId" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "arn:aws:acm:ca-central-1:122315759805:certificate/0b6982bc-da98-43a3-92b5-65f053aa2e9d" -> null
        }
      + setting {
          + name      = "SSLCertificateId"
          + namespace = "aws:elb:listener:443"
          + value     = "arn:aws:acm:ca-central-1:122315759805:certificate/0b6982bc-da98-43a3-92b5-65f053aa2e9d"
        }
        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.dist_item must be replaced
-/+ resource "aws_s3_bucket_object" "dist_item" {
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "62943479eb8cb8edf14d6eb563d094e2" -> (known after apply)
      ~ id                     = "staging/dist-c898b77b-e0fe-0f9d-132c-e11b878dd48b" -> (known after apply)
      ~ key                    = "staging/dist-c898b77b-e0fe-0f9d-132c-e11b878dd48b" -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      + server_side_encryption = (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ app_version = "staging-hello-world-ea0f3865-dbdc-609b-56a2-6dad574ffbd6" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*